[
    {
        "title":"คอมพิวเตอร์คืออะไร",
        "subtitle":"คอมพิวเตอร์ คือ อุปกรณ์ที่ใช้สำหรับการคำนวณและทำงานอื่นๆ",
        "image_url":"https://cdn.pixabay.com/photo/2016/03/09/09/17/desktop-1245714__340.jpg",
        "detail":"เครื่องคำนวณอิเล็กทรอนิกส์โดยใช้วิธีทางคณิตศาสตร์ประกอบด้วยฮาร์ดแวร์ (ส่วนตัวเครื่องและอุปกรณ์) \nและซอฟต์แวร์ (ส่วนชุดคำสั่ง หรือโปรแกรมที่สั่งให้คอมพิวเตอร์ำทำงาน) \nสามารถทำงานคำนวณผล และเปรียบเทียบค่าตามชุดคำสั่งด้วยความเร็วสูงอย่างต่อเนื่อง และอัตโนมัติ."
    },
    {
        "title":"แรมคืออะไร",
        "subtitle":"แรม คือ หน่วยความจำ",
        "image_url":"https://media.istockphoto.com/photos/computer-memory-picture-id861162264?s=612x612",
        "detail":"Ram (Random-access memory) หรือ แรม เป็นหน่วยความจำหลักของคอมพิวเตอร์ \nซึ่งเป็นองค์ประกอบสำคัญที่มีผลต่อประสิทธิภาพการทำงานโดยรวม ทั้งยังส่งผลต่อความเร็วในการทำงานของระบบคอมพิวเตอร์ ไม่ว่าอุปกรณ์ชนิดนั้นจะเป็นสมาร์ทโฟน, แท็บเล็ต, คอมพิวเตอร์ หรืออุปกรณ์ใดๆ ที่จำเป็นต้องอ่านและเขียนคำสั่งไปยังหน่วยความจำ\n\nRAM จัดว่าเป็นหน่วยความจำชั่วคราว (Short-Term Memory) โดยการทำงานของมันนั้นจะเป็นการเขียนหรือบันทึกข้อมูลแบบสุ่ม ึ่งหน่วยความจำชนิดนี้จะสามารถบันทึกข้อมูลลงในตำแหน่งต่างๆ ได้อย่างอิสระ ทั้งนี้ก็เพื่อเพิ่มความเร็วในการบันทึกและอ่านข้อมูล \nจึงเป็นที่มาของคำว่า Random access ขณะเดียวกันก็ทำให้มันแตกต่างจากหน่วยความจำประเภทอื่นๆ อย่างสิ้นเชิง เมื่อเทียบกับฮาร์ดไดร์ฟ (Hard Drive) หรือ SSD (ที่รู้จักกันในนามของ Direct Access Memory) สิ่งที่ทำให้มันแตกต่างจากหน่วยความจำที่เข้าถึงได้โดยตรงนั่นก็คือ เมื่อมีการตัดกระแสไฟฟ้าหรือปิดคอมพิวเตอร์ ข้อมูลที่อยู่ภายใน Ram ก็จะหายไปอย่างสมบูรณ์"
    },
    {
        "title":"CPU คือ อะไร?",
        "subtitle":"CPU คือ ตัวประมวลผลของคอมพิวเตอร์",
        "image_url":"https://media.istockphoto.com/photos/microprocessor-and-cpu-technology-concept-picture-id1165403763",
        "detail":"CPU คือหน่วยประมวลผลกลางของคอมพิวเตอร์เปรียบเหมือนสมองที่คอยทำหน้าที่ในการตัดสินใจหรือคำนวณข้อมูลคำสั่งที่ได้รับมา เป็นหัวใจหลักในการประมวลผล \nCPU นั้นย่อมาจาก Central Processing Unit ทำหน้าที่ประมวลผลข้อมูลเชิงตรรกะ โดยมีกระบวนการพื้นฐานคือ \n1.อ่านชุดคำสั่ง \n2.ตีความชุดคำสั่ง \n3.ประมวลผลชุดคำสั่ง \n4.อ่านข้อมูลจากหน่วยความจำ \n5.เขียนข้อมูล/ส่งผลการประมวล\n\nปัจจุบัน CPU อยู่ในรูปแบบของ Socket มีรูปลักษณะเป็นแผ่นสี่เหลี่ยมจัตุรัสทำด้วยเซรามิก ด้านบนกรอบของซีพียูจะบอกรายละเอียดสเปคของซีพียูตัวนั้นๆเมื่อประกอบกับเมนบอร์ดจะดูเหมือนอยู่ในตลับและต้องถูกครอบทับอีกทีด้วยพัดลมหรือชุดน้ำระบายความร้อน"
    },
    {
        "title":"Hard disk คือ อะไร?",
        "subtitle":"Hard disk คือ ตัวเก็บข้อมูลของคอมพิวเตอร์",
        "image_url":"https://media.istockphoto.com/photos/detailed-view-of-the-inside-of-a-hard-disk-drive-picture-id639404138",
        "detail":"Harddisk คืออุปกรณ์คอมพิวเตอร์ที่บรรจุข้อมูล แบบไม่ลบเลือน HDD ย่อมาจาก Hard Disk Drive มีลักษณะเป็นจานโลหะซึ่งจะหมุนอย่างรวดเร็วเมื่อทำงาน เมื่อติดตั้งเข้ากับตัวคอมพิวเตอร์สามารถทำได้ผ่านการต่อเข้ากับเมนบอร์ด อีกทั้งยังสามารถต่อใช่งานจากภายนอกได้ผ่านทางสาย USB \nซึ่งทำให้การใช้ฮาร์ดดิสสะดวกยิ่งขึ้นเมื่อไม่ได้ใช้คอมพิวเตอร์ของตนเอง ขนาดของฮาร์ดดิสปัจจุบันนิยมกันอยู่ 2 ขนาดคือ 3.5นิ้ว ที่นิยมใช้ในคอมพิวเตอร์ตั้งโต๊ะทั่วไปและ 2.5นิ้ว ที่จะใช้กับ Notebook ความเร็วในการบันทึกข้อมูลของ Harddisk ใช้หน่วยเป็น RPM (Revolutions Pes Minute) \nในปัจจุบันฮาร์ดดิสมีความเร็วในการบันทึกข้อมูลตั้งแต่ 5400RPM ที่เป็นความเร็วมาตรฐานของฮาร์ดดิสทั่วไปจนไปถึง 15,000RPM มีเป็นฮาร์ดดิสความเร็วสูงสำหรับเครื่องเซิร์ฟเวอร์ ความจุของฮาร์ดดิสคือเนื้อที่ในการจัดเก็บข้อมูล ยิ่งมีความจุมากก็ยิ่งบันทึกข้อมูลได้มากยิ่งขึ้น ฮาร์ดดิสในขณะนี้ก็มีความจุตั้งแต่ 500GB ไปจนถึง 20TB"
    }
]
